In [1]:
# 포폴에도 Seaborn 쓴거 있어야 해요
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
# 한글 폰트 문제 해결 
# matplotlib은 한글 폰트를 지원하지 않음
# os정보
import platform

# font_manager : 폰트 관리 모듈
# rc : 폰트 변경 모듈
from matplotlib import font_manager, rc
# unicode 설정
plt.rcParams['axes.unicode_minus'] = False

if platform.system() == 'Darwin':
    rc('font', family='AppleGothic') # os가 macos
elif platform.system() == 'Windows':
    path = 'c:/Windows/Fonts/malgun.ttf' # os가 windows
    font_name = font_manager.FontProperties(fname=path).get_name()
    rc('font', family=font_name)
else:
    print("Unknown System")

In [192]:
elementarySCH = pd.read_csv("../../Data/study/시군구별.초등학생_학생수_변화.csv",index_col=0)
middelSchool = pd.read_csv("../../Data/study/시군구별.중학생_학생수_변화.csv",index_col=0)
highSchool = pd.read_csv("../../Data/study/시군구별.고등학생_학생수_변화.csv",index_col=0)
Uchi = pd.read_csv("../../Data/study/시군구별.유치원_원아수_변화.csv",index_col=0)

In [202]:
od = []
od.append(elementarySCH.지역.unique())
aa = []
for i in range(len(elementarySCH.지역.unique())):
    aa.append(od[0][i])
aa

['경기도',
 '서울특별시',
 '부산광역시',
 '경상남도',
 '인천광역시',
 '경상북도',
 '대구광역시',
 '전라남도',
 '전라북도',
 '충청남도',
 '광주광역시',
 '대전광역시',
 '충청북도',
 '강원도',
 '울산광역시',
 '제주특별자치도',
 '세종특별자치시']

In [200]:
elementarySCH.지역.unique()

array(['경기도', '서울특별시', '부산광역시', '경상남도', '인천광역시', '경상북도', '대구광역시', '전라남도',
       '전라북도', '충청남도', '광주광역시', '대전광역시', '충청북도', '강원도', '울산광역시',
       '제주특별자치도', '세종특별자치시'], dtype=object)

In [194]:
middelSchool

       시점       지역  중학생인원수변화
0    2000      경기도    359220
1    2000    서울특별시    375605
2    2000     경상남도    122943
3    2000    인천광역시    105546
4    2000    부산광역시    150783
..    ...      ...       ...
386  2022    대전광역시     40303
387  2022      강원도     37922
388  2022    울산광역시     32966
389  2022  제주특별자치도     20126
390  2022  세종특별자치시     14809

[391 rows x 3 columns]

In [208]:
elementarySCH

       시점       지역  초등학생인원수변화
0    2000      경기도     889034
1    2000    서울특별시     759443
2    2000    부산광역시     294929
3    2000     경상남도     269119
4    2000    인천광역시     245716
..    ...      ...        ...
386  2022     충청북도      83827
387  2022      강원도      71530
388  2022    울산광역시      66450
389  2022  제주특별자치도      41628
390  2022  세종특별자치시      32230

[391 rows x 3 columns]

In [209]:
dd = pd.merge(middelSchool,elementarySCH,on=['시점','지역'], how='inner')
dd

       시점       지역  중학생인원수변화  초등학생인원수변화
0    2000      경기도    359220     889034
1    2000    서울특별시    375605     759443
2    2000     경상남도    122943     269119
3    2000    인천광역시    105546     245716
4    2000    부산광역시    150783     294929
..    ...      ...       ...        ...
386  2022    대전광역시     40303      76960
387  2022      강원도     37922      71530
388  2022    울산광역시     32966      66450
389  2022  제주특별자치도     20126      41628
390  2022  세종특별자치시     14809      32230

[391 rows x 4 columns]

In [109]:
elementarySCH = elementarySCH.sort_values(by='지역')
elementarySCH.iloc[:,1].unique()
elementarySCH['초등학생인원수변화']

217     88865
234     83187
387     71530
183     99797
251     80458
        ...
386     83827
301     84240
318     85344
29     126177
97     126588
Name: 초등학생인원수변화, Length: 391, dtype: int64

In [108]:
middelSchool = middelSchool.sort_values(by='지역')
middelSchool.iloc[:,1].unique()
middelSchool['중학생인원수변화']

       시점    지역  중학생인원수변화
183  2010   강원도     58408
234  2013   강원도     54755
81   2004   강원도     57523
200  2011   강원도     57321
166  2009   강원도     58605
..    ...   ...       ...
164  2009  충청북도     63516
79   2004  충청북도     58853
249  2014  충청북도     54970
232  2013  충청북도     57623
96   2005  충청북도     61447

[391 rows x 3 columns]

In [166]:
highSchool = highSchool.sort_values(by='지역')
highSchool.iloc[:,1].unique()
highSchool

       시점    지역  고등학생인원수변화
183  2010   강원도      56711
234  2013   강원도      56601
81   2004   강원도      55002
200  2011   강원도      56520
166  2009   강원도      56683
..    ...   ...        ...
45   2002  충청북도      58804
164  2009  충청북도      64931
79   2004  충청북도      57617
232  2013  충청북도      62812
96   2005  충청북도      58205

[391 rows x 3 columns]

In [99]:
Uchi = Uchi.sort_values(by='지역')
Uchi.iloc[:,1].unique()
Uchi

       시점    지역  유치원원아수변화
149  2008   강원도     14422
217  2012   강원도     15158
234  2013   강원도     16007
13   2000   강원도     17045
353  2020   강원도     14679
..    ...   ...       ...
267  2015  충청북도     18305
233  2013  충청북도     17446
386  2022  충청북도     14993
301  2017  충청북도     18351
148  2008  충청북도     15359

[391 rows x 3 columns]

In [210]:
bb = pd.merge(highSchool,Uchi,on=['시점','지역'])
bb

       시점       지역  고등학생인원수변화  유치원원아수변화
0    2000      경기도     341998    113474
1    2000    서울특별시     453068     94690
2    2000    인천광역시     136580     26811
3    2000     경상남도     177255     42499
4    2000    부산광역시     108187     40694
..    ...      ...        ...       ...
386  2022    대전광역시      39112     20405
387  2022      강원도      36821     13168
388  2022    울산광역시      29557     14779
389  2022  제주특별자치도      18093      5945
390  2022  세종특별자치시      11484      6422

[391 rows x 4 columns]

In [211]:
school = pd.merge(dd,bb,on=['시점','지역'])
school

       시점       지역  중학생인원수변화  초등학생인원수변화  고등학생인원수변화  유치원원아수변화
0    2000      경기도    359220     889034     341998    113474
1    2000    서울특별시    375605     759443     453068     94690
2    2000     경상남도    122943     269119     177255     42499
3    2000    인천광역시    105546     245716     136580     26811
4    2000    부산광역시    150783     294929     108187     40694
..    ...      ...       ...        ...        ...       ...
386  2022    대전광역시     40303      76960      39112     20405
387  2022      강원도     37922      71530      36821     13168
388  2022    울산광역시     32966      66450      29557     14779
389  2022  제주특별자치도     20126      41628      18093      5945
390  2022  세종특별자치시     14809      32230      11484      6422

[391 rows x 6 columns]

In [105]:
Uchi['유치원원아수변화']

149    14422
217    15158
234    16007
13     17045
353    14679
       ...
267    18305
233    17446
386    14993
301    18351
148    15359
Name: 유치원원아수변화, Length: 391, dtype: int64

In [167]:
highSchool['유치원원아수변화'] = Uchi['유치원원아수변화']
highSchool['초등학생인원수변화'] = elementarySCH['초등학생인원수변화']
highSchool['중학생인원수변화'] = middelSchool['중학생인원수변화']
highSchool

       시점    지역  고등학생인원수변화  유치원원아수변화  초등학생인원수변화  중학생인원수변화
183  2010   강원도      56711     14137      99797     58408
234  2013   강원도      56601     16007      83187     54755
81   2004   강원도      55002     15921     122661     57523
200  2011   강원도      56520     14226      94442     57321
166  2009   강원도      56683     14343     105480     58605
..    ...   ...        ...       ...        ...       ...
45   2002  충청북도      58804     18774     130998     57591
164  2009  충청북도      64931     15978     114621     63516
79   2004  충청북도      57617     17936     131906     58853
232  2013  충청북도      62812     19032      93398     57623
96   2005  충청북도      58205     17718     129952     61447

[391 rows x 6 columns]

In [168]:
highSchool.iloc[:,0]

183    2010
234    2013
81     2004
200    2011
166    2009
       ...
45     2002
164    2009
79     2004
232    2013
96     2005
Name: 시점, Length: 391, dtype: int64

In [174]:
highSchool

       시점    지역  고등학생인원수변화  유치원원아수변화  초등학생인원수변화  중학생인원수변화
183  2010   강원도      56711     14137      99797     58408
234  2013   강원도      56601     16007      83187     54755
81   2004   강원도      55002     15921     122661     57523
200  2011   강원도      56520     14226      94442     57321
166  2009   강원도      56683     14343     105480     58605
..    ...   ...        ...       ...        ...       ...
45   2002  충청북도      58804     18774     130998     57591
164  2009  충청북도      64931     15978     114621     63516
79   2004  충청북도      57617     17936     131906     58853
232  2013  충청북도      62812     19032      93398     57623
96   2005  충청북도      58205     17718     129952     61447

[391 rows x 6 columns]

In [179]:
highSchool = highSchool.iloc[:,:].sort_values(by='시점',ascending=True)
highSchool

       시점       지역  고등학생인원수변화  유치원원아수변화  초등학생인원수변화  중학생인원수변화
7    2000     전라남도      84959     24704     163677     73993
9    2000     충청남도      97935     21416     151526     79535
12   2000    대전광역시      65887     18450     124176     60020
11   2000     충청북도      66432     19601     125748     60603
6    2000    대구광역시     118167     26811     216465    105198
..    ...      ...        ...       ...        ...       ...
380  2022    대구광역시      59373     35427     121485     61975
389  2022  제주특별자치도      18093      5945      41628     20126
382  2022     전라북도      48265     23647      91290     49084
377  2022     경상남도      70161     36308     187423     78827
378  2022    부산광역시      71760     31365     155906     74941

[391 rows x 6 columns]

In [180]:
highSchool

       시점       지역  고등학생인원수변화  유치원원아수변화  초등학생인원수변화  중학생인원수변화
7    2000     전라남도      84959     24704     163677     73993
9    2000     충청남도      97935     21416     151526     79535
12   2000    대전광역시      65887     18450     124176     60020
11   2000     충청북도      66432     19601     125748     60603
6    2000    대구광역시     118167     26811     216465    105198
..    ...      ...        ...       ...        ...       ...
380  2022    대구광역시      59373     35427     121485     61975
389  2022  제주특별자치도      18093      5945      41628     20126
382  2022     전라북도      48265     23647      91290     49084
377  2022     경상남도      70161     36308     187423     78827
378  2022    부산광역시      71760     31365     155906     74941

[391 rows x 6 columns]

In [187]:
highSchool03 = highSchool[highSchool['시점']>2002]
highSchool03

       시점       지역  고등학생인원수변화  유치원원아수변화  초등학생인원수변화  중학생인원수변화
63   2003    대전광역시      56694     17140     129175     60236
67   2003  세종특별자치시          0         0          0         0
61   2003    광주광역시      57508     20609     138644     61201
53   2003    인천광역시     114502     43956     288174    121832
64   2003      강원도      56692     16276     124305     56816
..    ...      ...        ...       ...        ...       ...
380  2022    대구광역시      59373     35427     121485     61975
389  2022  제주특별자치도      18093      5945      41628     20126
382  2022     전라북도      48265     23647      91290     49084
377  2022     경상남도      70161     36308     187423     78827
378  2022    부산광역시      71760     31365     155906     74941

[340 rows x 6 columns]

In [189]:
highSchool03 = highSchool03.sort_values(by="지역")
highSchool03

       시점    지역  고등학생인원수변화  유치원원아수변화  초등학생인원수변화  중학생인원수변화
234  2013   강원도      56601     16007      83187     54755
353  2020   강원도      39806     14679      73478     37836
251  2014   강원도      55974     15947      80458     51976
166  2009   강원도      56683     14343     105480     58605
217  2012   강원도      56519     15158      88865     56162
..    ...   ...        ...       ...        ...       ...
130  2007  충청북도      60828     16702     125583     64291
283  2016  충청북도      57087     19604      85939     46287
96   2005  충청북도      58205     17718     129952     61447
368  2021  충청북도      40840     15871      77884     42438
198  2011  충청북도      64132     16225     103852     61590

[340 rows x 6 columns]

In [182]:
dehak = pd.read_csv("../../Data/study/시군구별.대학교_학교수_변화.csv",index_col=0)
dehaksu = pd.read_csv("../../Data/study/시군구별.대학교_학생수_변화.csv",index_col=0)
acdemey = pd.read_csv("../../Data/study/시군구별.사설학원_갯수변화.csv",index_col=0)
acdemey

       시점       지역  사설학원수
0    2003      경기도  13837
1    2003    서울특별시  11176
2    2003     경상남도   5646
3    2003    부산광역시   4987
4    2003    대구광역시   2978
..    ...      ...    ...
335  2022     충청북도   2381
336  2022    대전광역시   2294
337  2022      강원도   2264
338  2022  제주특별자치도   1167
339  2022  세종특별자치시    920

[340 rows x 3 columns]

In [190]:
acdemey03 = acdemey.sort_values("지역")
acdemey03

       시점    지역  사설학원수
116  2009   강원도   2393
99   2008   강원도   2322
82   2007   강원도   2315
320  2021   강원도   2188
252  2017   강원도   2223
..    ...   ...    ...
267  2018  충청북도   2249
80   2007  충청북도   2221
63   2006  충청북도   2154
216  2015  충청북도   2338
29   2004  충청북도   1834

[340 rows x 3 columns]

In [191]:
highSchool03

       시점    지역  고등학생인원수변화  유치원원아수변화  초등학생인원수변화  중학생인원수변화
234  2013   강원도      56601     16007      83187     54755
353  2020   강원도      39806     14679      73478     37836
251  2014   강원도      55974     15947      80458     51976
166  2009   강원도      56683     14343     105480     58605
217  2012   강원도      56519     15158      88865     56162
..    ...   ...        ...       ...        ...       ...
130  2007  충청북도      60828     16702     125583     64291
283  2016  충청북도      57087     19604      85939     46287
96   2005  충청북도      58205     17718     129952     61447
368  2021  충청북도      40840     15871      77884     42438
198  2011  충청북도      64132     16225     103852     61590

[340 rows x 6 columns]

In [221]:
dehaksu[dehaksu['시점']==2009]

      시점       지역   대학생숫자
34  2009    서울특별시  533420
35  2009      경기도  504165
36  2009    부산광역시  270828
37  2009     경상북도  232813
38  2009     충청남도  235383
39  2009    대전광역시  146316
40  2009     경상남도  129953
41  2009     전라북도  132779
42  2009      강원도  126994
43  2009     충청북도  126112
44  2009    대구광역시  123998
45  2009    광주광역시  116786
46  2009     전라남도   90337
47  2009    인천광역시   79547
48  2009    울산광역시   32982
49  2009  제주특별자치도   28806
50  2009  세종특별자치시       0

In [184]:
dehak

       시점       지역  대학교_숫자
0    2003      경기도      61
1    2003    서울특별시      52
2    2003     경상북도      38
3    2003     충청남도      24
4    2003    부산광역시      23
..    ...      ...     ...
335  2022    대구광역시      11
336  2022    인천광역시       7
337  2022  제주특별자치도       4
338  2022    울산광역시       4
339  2022  세종특별자치시       3

[340 rows x 3 columns]

In [215]:
school = school[school['시점']> 2002]
school

       시점       지역  중학생인원수변화  초등학생인원수변화  고등학생인원수변화  유치원원아수변화
51   2003      경기도    402500     983887     340105    123587
52   2003    서울특별시    359457     759010     366556     89232
53   2003     경상남도    121832     283632     140932     43956
54   2003    인천광역시    109493     247046     114502     27274
55   2003    부산광역시    141010     288174      99033     39803
..    ...      ...       ...        ...        ...       ...
386  2022    대전광역시     40303      76960      39112     20405
387  2022      강원도     37922      71530      36821     13168
388  2022    울산광역시     32966      66450      29557     14779
389  2022  제주특별자치도     20126      41628      18093      5945
390  2022  세종특별자치시     14809      32230      11484      6422

[340 rows x 6 columns]

In [216]:
totoro = pd.merge(dehak,school,on=['시점','지역'])
totoro

       시점       지역  대학교_숫자  중학생인원수변화  초등학생인원수변화  고등학생인원수변화  유치원원아수변화
0    2003      경기도      61    402500     983887     340105    123587
1    2003    서울특별시      52    359457     759010     366556     89232
2    2003     경상북도      38     96960     216719      97636     35801
3    2003     충청남도      24     69328     156793      72897     20714
4    2003    부산광역시      23    141010     288174      99033     39803
..    ...      ...     ...       ...        ...        ...       ...
335  2022    대구광역시      11     61975     121485      59373     32272
336  2022    인천광역시       7     78827     155906      84613     35427
337  2022  제주특별자치도       4     20126      41628      18093      5945
338  2022    울산광역시       4     32966      66450      29557     14779
339  2022  세종특별자치시       3     14809      32230      11484      6422

[340 rows x 7 columns]

In [218]:
merge7 = pd.merge(acdemey,totoro,on=['시점','지역'])
merge7

       시점       지역  사설학원수  대학교_숫자  중학생인원수변화  초등학생인원수변화  고등학생인원수변화  유치원원아수변화
0    2003      경기도  13837      61    402500     983887     340105    123587
1    2003    서울특별시  11176      52    359457     759010     366556     89232
2    2003     경상남도   5646      19    121832     283632     140932     43956
3    2003    부산광역시   4987      23    141010     288174      99033     39803
4    2003    대구광역시   2978      10    106094     223849     100375     29212
..    ...      ...    ...     ...       ...        ...        ...       ...
335  2022     충청북도   2381      17     42601      83827      39153     14993
336  2022    대전광역시   2294      15     40303      76960      39112     20405
337  2022      강원도   2264      17     37922      71530      36821     13168
338  2022  제주특별자치도   1167       4     20126      41628      18093      5945
339  2022  세종특별자치시    920       3     14809      32230      11484      6422

[340 rows x 8 columns]

In [224]:
merge07 = merge7[merge7['시점']>2006]
merge8 = pd.merge(merge07,dehaksu,on=['시점','지역'])
merge8

,시점,지역,사설학원수,대학교_숫자,중학생인원수변화,초등학생인원수변화,고등학생인원수변화,유치원원아수변화,대학생숫자
0,2007,경기도,15591,61,489548,951908,411732,135245,485552
1,2007,서울특별시,11549,50,375937,665227,355193,82461,541288
2,2007,경상남도,5844,19,138629,264776,137276,44188,139584
3,2007,부산광역시,4779,22,144991,242193,106501,37921,265238
4,2007,대구광역시,2929,11,113962,199471,105396,27908,124318
...,...,...,...,...,...,...,...,...,...
267,2022,충청북도,2381,17,42601,83827,39153,14993,107511
268,2022,대전광역시,2294,15,40303,76960,39112,20405,123835
269,2022,강원도,2264,17,37922,71530,36821,13168,104253
270,2022,제주특별자치도,1167,4,20126,41628,18093,5945,25964
271,2022,세종특별자치시,920,3,14809,32230,11484,6422,21253

In [225]:
merge8.corr()

,시점,사설학원수,대학교_숫자,중학생인원수변화,초등학생인원수변화,고등학생인원수변화,유치원원아수변화,대학생숫자
시점,1.000000,0.054439,-0.012732,-0.159846,-0.104320,-0.127816,0.040025,-0.056805
사설학원수,0.054439,1.000000,0.892733,0.942846,0.959349,0.950513,0.963740,0.864822
대학교_숫자,-0.012732,0.892733,1.000000,0.875631,0.882577,0.875749,0.858854,0.920939
중학생인원수변화,-0.159846,0.942846,0.875631,1.000000,0.991492,0.990054,0.933785,0.859594
초등학생인원수변화,-0.104320,0.959349,0.882577,0.991492,1.000000,0.980038,0.949589,0.849455
고등학생인원수변화,-0.127816,0.950513,0.875749,0.990054,0.980038,1.000000,0.944990,0.869837
유치원원아수변화,0.040025,0.963740,0.858854,0.933785,0.949589,0.944990,1.000000,0.798821
대학생숫자,-0.056805,0.864822,0.920939,0.859594,0.849455,0.869837,0.798821,1.000000

In [226]:
merge8.to_csv("../../Data/study/2007~2022유치원_대학_사설학원.csv")